cinemagic/app/views/movies/new.html.erb

SELECT "genres".* FROM "genres"
---
    <%= f.label :genre %><br>
    <%= f.collection_select :genres, Genre.all, :id, :name, prompt: true %>