cinemagic/app/views/movies/show.html.erb

<h3>Reviews</h3>
<% if @movie.reviews.length > 0 %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = $1  [["movie_id", 1]]

    <!-- from http://docs.railsbridge.org/intro-to-rails/allow_people_to_vote -->
    <%= pluralize(review.votes.count, "vote") %>
---
SELECT "votes".* FROM "votes" WHERE "votes"."review_id" = $1  [["review_id", 1]]
SELECT COUNT(*) FROM "votes" WHERE "votes"."review_id" = $1  [["review_id", 1]]

    <!-- comments -->
    <% if review.comments.length > 0 %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."review_id" = $1  [["review_id", 1]]