cinemagic/app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    @movie = Movie.find(params[:movie_id])
    @review = Review.find(params[:review_id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]