cinemagic/app/controllers/movies_controller.rb

  def welcome
    @movies = Movie.all
    @genres = Genre.all
---
SELECT "movies".* FROM "movies"
SELECT "genres".* FROM "genres"