cinemagic/app/controllers/movies_controller.rb

  def index
    Tmdb::Api.key("38f294747ee749570b4e4b934ab5de83")
    @movies = Movie.all
    @genres = Genre.all
---
SELECT "genres".* FROM "genres"