cinemagic/app/controllers/reviews_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    # before_action :authenticate_user!
    @review = Review.new
    @movie = Movie.find(params[:movie_id])

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("user_id", "movie_id", "star_rating", "text") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["movie_id", 1], ["star_rating", 3], ["text", "I loved it so much."]]
---
  def create
    # before_action :authenticate_user!
    @movie = Movie.find(params[:movie_id])
    # this cromulent business is temporary; we hard-coded a user ID and inserted
    # it into the hash that is passed into the create
    review_params
    cromulent = review_params
    cromulent[:user_id] = 1
      p "*"*55
    p cromulent
    @review = @movie.reviews.create(cromulent)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @movie = Movie.find(params[:movie_id])
    @review = Review.find(params[:id])

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "votes" ("user_id", "review_id") VALUES ($1, $2) RETURNING "id"  [["user_id", 72], ["review_id", 1]]
---
  def upvote
    @review = Review.find(params[:id])
    @movie = Movie.find(@review.movie_id)
    vote = @review.votes.create(user_id: @review.user_id)